In [1]:
import pandas as pd
import numpy as np

In [2]:
file = '../Mango5/imdb_top_1000.csv'

In [3]:
topmovies_df = pd.read_csv(file, encoding = "ISO-8859-1")

In [4]:
genre_topmovies_df=topmovies_df[["Genre", "IMDB_Rating"]]
result_genre = genre_topmovies_df.set_index('IMDB_Rating').apply(lambda col:
    col.str.split(', ?', expand=True).stack())\
    .droplevel(1).reset_index().fillna('')
genre_values=result_genre["Genre"].value_counts()
genre_values_sorted = genre_values.sort_index(axis=0, ascending=True).to_frame()
genre_values_sorted

           Genre
Action       189
Adventure    196
Animation     82
Biography    109
Comedy       233
Crime        209
Drama        724
Family        56
Fantasy       66
Film-Noir     19
History       56
Horror        32
Music         35
Musical       17
Mystery       99
Romance      125
Sci-Fi        67
Sport         19
Thriller     137
War           51
Western       20

In [5]:
topmovies_df['star_df'] = topmovies_df['Star1'] + "," + topmovies_df['Star2'] + "," + topmovies_df['Star3'] + "," + topmovies_df['Star4']
star_topmovies_df = topmovies_df[["star_df", "IMDB_Rating"]]
result_star = star_topmovies_df.set_index('IMDB_Rating').apply(lambda col:
    col.str.split(', ?', expand=True).stack())\
    .droplevel(1).reset_index().fillna('')
star_values=result_star["star_df"].value_counts().to_frame()
star_values

                star_df
Robert De Niro       17
Tom Hanks            14
Al Pacino            13
Clint Eastwood       12
Brad Pitt            12
...                 ...
Suraj Sharma          1
Peter Boyle           1
Anushka Shetty        1
Charlie Yeung         1
John Sharian          1

[2709 rows x 1 columns]

In [6]:
director_df = topmovies_df['Director'].value_counts().to_frame()
director_df

                   Director
Alfred Hitchcock         14
Steven Spielberg         13
Hayao Miyazaki           11
Akira Kurosawa           10
Martin Scorsese          10
...                     ...
Roberto Benigni           1
Mike Judge                1
Sam Wood                  1
Eric Bress                1
Mikael HÃ¥fstrÃ¶m         1

[548 rows x 1 columns]